backend/app/controllers/appointments_controller.rb

  def show
    appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]