backend/app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save
---
INSERT INTO "appointments" ("time", "client", "barber", "day_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["time", "5:00 AM"], ["client", "hi"], ["barber", "hi"], ["day_id", 9], ["created_at", "2021-03-28 14:55:33.742090"], ["updated_at", "2021-03-28 14:55:33.742090"]]

  def update
    if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "client" = ?, "barber" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["client", "hiya"], ["barber", "hiya"], ["updated_at", "2021-03-28 18:04:05.466287"], ["id", 1]]