backend/app/controllers/barbers_controller.rb

  def index
    barbers = Barber.all
---
SELECT "barbers".* FROM "barbers"