backend/app/controllers/days_controller.rb

  def index
    days = Day.all
---
SELECT "days".* FROM "days"

  def show
    day = Day.find(params[:id])
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    day = Day.new(day_params)
    if day.save
---
INSERT INTO "days" ("num_day", "month", "year", "open_hour", "open_minutes", "open_ampm", "close_hour", "close_minutes", "close_ampm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    day = Day.find(params[:id])
    if day.update(day_params)
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "days" SET "close_hour" = ?, "updated_at" = ? WHERE "days"."id" = ?  [["close_hour", 19], ["updated_at", "2021-03-28 18:08:40.265602"], ["id", 1]]

  def destroy
    day = Day.find(params[:id])
    day.destroy
---
SELECT "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "days" WHERE "days"."id" = ?  [["id", 1]]